In [22]:
import numpy as np
import pandas as pd

In [3]:
dic1={
    "name":['harry','shubham','gill','jerry','mohan'],
    "marks":[92,75,50,85,95],
    "city":['rampur','kolkata','bareli','umreli','rajasthan']
}

In [23]:
df=pd.DataFrame(dic1)

In [24]:
df

      name  marks       city
0    harry     92     rampur
1  shubham     75    kolkata
2     gill     50     bareli
3    jerry     85     umreli
4    mohan     95  rajasthan

In [25]:
df.to_csv('marks.csv')

In [26]:
df.head(2)

      name  marks     city
0    harry     92   rampur
1  shubham     75  kolkata

In [27]:
df.tail(2)

    name  marks       city
3  jerry     85     umreli
4  mohan     95  rajasthan

In [28]:
df.describe()

           marks
count   5.000000
mean   79.400000
std    18.146625
min    50.000000
25%    75.000000
50%    85.000000
75%    92.000000
max    95.000000

In [29]:
first= pd.read_csv('iris.csv')

In [30]:
first

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2         se
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [31]:
first['species']

0             se
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [32]:
ser=pd.Series(np.random.rand(30))

In [33]:
ser

0     0.007626
1     0.185766
2     0.019674
3     0.716397
4     0.829656
5     0.650141
6     0.478872
7     0.471318
8     0.170383
9     0.056786
10    0.930253
11    0.848056
12    0.155595
13    0.761042
14    0.176127
15    0.822931
16    0.055597
17    0.783438
18    0.809184
19    0.336302
20    0.624317
21    0.882190
22    0.067475
23    0.484529
24    0.438940
25    0.971639
26    0.214613
27    0.669733
28    0.589951
29    0.425993
dtype: float64

In [34]:
ser.T

0     0.007626
1     0.185766
2     0.019674
3     0.716397
4     0.829656
5     0.650141
6     0.478872
7     0.471318
8     0.170383
9     0.056786
10    0.930253
11    0.848056
12    0.155595
13    0.761042
14    0.176127
15    0.822931
16    0.055597
17    0.783438
18    0.809184
19    0.336302
20    0.624317
21    0.882190
22    0.067475
23    0.484529
24    0.438940
25    0.971639
26    0.214613
27    0.669733
28    0.589951
29    0.425993
dtype: float64

In [35]:
df.T

            0        1       2       3          4
name    harry  shubham    gill   jerry      mohan
marks      92       75      50      85         95
city   rampur  kolkata  bareli  umreli  rajasthan

In [36]:
df.loc["name",0]="mukul"

In [37]:
df

         name  marks       city      0
0       harry   92.0     rampur    nan
1     shubham   75.0    kolkata    nan
2        gill   50.0     bareli    nan
3       jerry   85.0     umreli    nan
4       mohan   95.0  rajasthan    nan
name      NaN    NaN        NaN  mukul

In [38]:
df.loc[0,"name"]="mukul"

In [39]:
df

         name  marks       city      0
0       mukul   92.0     rampur    nan
1     shubham   75.0    kolkata    nan
2        gill   50.0     bareli    nan
3       jerry   85.0     umreli    nan
4       mohan   95.0  rajasthan    nan
name      NaN    NaN        NaN  mukul

In [40]:
df.isnull()

       name  marks   city      0
0     False  False  False  False
1     False  False  False  False
2     False  False  False  False
3     False  False  False  False
4     False  False  False  False
name   True   True   True  False

In [41]:
df.notnull()

       name  marks   city     0
0      True   True   True  True
1      True   True   True  True
2      True   True   True  True
3      True   True   True  True
4      True   True   True  True
name  False  False  False  True